Microchip-MPLAB-Harmony/csp_apps_pic32cm_jh00_jh01/apps/nvmctrl/nvmctrl_data_flash/firmware/src/packs/PIC32CM5164JH00100_DFP/component/nvmctrl.h
#define NVMCTRL_INTENCLR_READY_Pos            _U_(0)                                               /**< (NVMCTRL_INTENCLR) NVM Ready Interrupt Enable Position */
#define NVMCTRL_INTENCLR_READY_Msk            (_U_(0x1) << NVMCTRL_INTENCLR_READY_Pos)             /**< (NVMCTRL_INTENCLR) NVM Ready Interrupt Enable Mask */
#define NVMCTRL_INTENCLR_READY(value)         (NVMCTRL_INTENCLR_READY_Msk & ((value) << NVMCTRL_INTENCLR_READY_Pos))
#define NVMCTRL_INTENCLR_ERROR_Pos            _U_(1)                                               /**< (NVMCTRL_INTENCLR) Error Interrupt Enable Position */
#define NVMCTRL_INTENCLR_ERROR_Msk            (_U_(0x1) << NVMCTRL_INTENCLR_ERROR_Pos)             /**< (NVMCTRL_INTENCLR) Error Interrupt Enable Mask */
#define NVMCTRL_INTENCLR_ERROR(value)         (NVMCTRL_INTENCLR_ERROR_Msk & ((value) << NVMCTRL_INTENCLR_ERROR_Pos))
#define NVMCTRL_INTENCLR_SERR_Pos             _U_(8)                                               /**< (NVMCTRL_INTENCLR) Single Bit Error Detection Flag bit Disable Position */
#define NVMCTRL_INTENCLR_SERR_Msk             (_U_(0x1) << NVMCTRL_INTENCLR_SERR_Pos)              /**< (NVMCTRL_INTENCLR) Single Bit Error Detection Flag bit Disable Mask */
#define NVMCTRL_INTENCLR_SERR(value)          (NVMCTRL_INTENCLR_SERR_Msk & ((value) << NVMCTRL_INTENCLR_SERR_Pos))
#define NVMCTRL_INTENCLR_DERR_Pos             _U_(9)                                               /**< (NVMCTRL_INTENCLR) Double Bit Error Detection Flag bit Disable Position */
#define NVMCTRL_INTENCLR_DERR_Msk             (_U_(0x1) << NVMCTRL_INTENCLR_DERR_Pos)              /**< (NVMCTRL_INTENCLR) Double Bit Error Detection Flag bit Disable Mask */
#define NVMCTRL_INTENCLR_DERR(value)          (NVMCTRL_INTENCLR_DERR_Msk & ((value) << NVMCTRL_INTENCLR_DERR_Pos))
#define NVMCTRL_INTENCLR_FLTCAP_Pos           _U_(24)                                              /**< (NVMCTRL_INTENCLR) Fault Capture interrupt enable bit Disable Position */
#define NVMCTRL_INTENCLR_FLTCAP_Msk           (_U_(0x1) << NVMCTRL_INTENCLR_FLTCAP_Pos)            /**< (NVMCTRL_INTENCLR) Fault Capture interrupt enable bit Disable Mask */
#define NVMCTRL_INTENCLR_FLTCAP(value)        (NVMCTRL_INTENCLR_FLTCAP_Msk & ((value) << NVMCTRL_INTENCLR_FLTCAP_Pos))
#define NVMCTRL_INTENCLR_Msk                  _U_(0x01000303)                                      /**< (NVMCTRL_INTENCLR) Register Mask  */


/* -------- NVMCTRL_INTENSET : (NVMCTRL Offset: 0x10) (R/W 32) Interrupt Enable Set -------- */
#define NVMCTRL_INTENSET_RESETVALUE           _U_(0x00)                                            /**<  (NVMCTRL_INTENSET) Interrupt Enable Set  Reset Value */

#define NVMCTRL_INTENSET_READY_Pos            _U_(0)                                               /**< (NVMCTRL_INTENSET) NVM Ready Interrupt Enable Position */
#define NVMCTRL_INTENSET_READY_Msk            (_U_(0x1) << NVMCTRL_INTENSET_READY_Pos)             /**< (NVMCTRL_INTENSET) NVM Ready Interrupt Enable Mask */
#define NVMCTRL_INTENSET_READY(value)         (NVMCTRL_INTENSET_READY_Msk & ((value) << NVMCTRL_INTENSET_READY_Pos))
#define NVMCTRL_INTENSET_ERROR_Pos            _U_(1)                                               /**< (NVMCTRL_INTENSET) Error Interrupt Enable Position */
#define NVMCTRL_INTENSET_ERROR_Msk            (_U_(0x1) << NVMCTRL_INTENSET_ERROR_Pos)             /**< (NVMCTRL_INTENSET) Error Interrupt Enable Mask */
#define NVMCTRL_INTENSET_ERROR(value)         (NVMCTRL_INTENSET_ERROR_Msk & ((value) << NVMCTRL_INTENSET_ERROR_Pos))
#define NVMCTRL_INTENSET_SERR_Pos             _U_(8)                                               /**< (NVMCTRL_INTENSET) Single Bit Error Detection Flag bit Enable Position */
#define NVMCTRL_INTENSET_SERR_Msk             (_U_(0x1) << NVMCTRL_INTENSET_SERR_Pos)              /**< (NVMCTRL_INTENSET) Single Bit Error Detection Flag bit Enable Mask */
#define NVMCTRL_INTENSET_SERR(value)          (NVMCTRL_INTENSET_SERR_Msk & ((value) << NVMCTRL_INTENSET_SERR_Pos))
#define NVMCTRL_INTENSET_DERR_Pos             _U_(9)                                               /**< (NVMCTRL_INTENSET) Double Bit Error Detection Flag bit Enable Position */
#define NVMCTRL_INTENSET_DERR_Msk             (_U_(0x1) << NVMCTRL_INTENSET_DERR_Pos)              /**< (NVMCTRL_INTENSET) Double Bit Error Detection Flag bit Enable Mask */
#define NVMCTRL_INTENSET_DERR(value)          (NVMCTRL_INTENSET_DERR_Msk & ((value) << NVMCTRL_INTENSET_DERR_Pos))
#define NVMCTRL_INTENSET_FLTCAP_Pos           _U_(24)                                              /**< (NVMCTRL_INTENSET) Fault Capture interrupt enable bit Enable Position */
#define NVMCTRL_INTENSET_FLTCAP_Msk           (_U_(0x1) << NVMCTRL_INTENSET_FLTCAP_Pos)            /**< (NVMCTRL_INTENSET) Fault Capture interrupt enable bit Enable Mask */
#define NVMCTRL_INTENSET_FLTCAP(value)        (NVMCTRL_INTENSET_FLTCAP_Msk & ((value) << NVMCTRL_INTENSET_FLTCAP_Pos))
#define NVMCTRL_INTENSET_Msk                  _U_(0x01000303)                                      /**< (NVMCTRL_INTENSET) Register Mask  */


/* -------- NVMCTRL_INTFLAG : (NVMCTRL Offset: 0x14) (R/W 32) Interrupt Flag Status and Clear -------- */
#define NVMCTRL_INTFLAG_RESETVALUE            _U_(0x00)                                            /**<  (NVMCTRL_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

#define NVMCTRL_INTFLAG_READY_Pos             _U_(0)                                               /**< (NVMCTRL_INTFLAG) NVM Ready Position */
#define NVMCTRL_INTFLAG_READY_Msk             (_U_(0x1) << NVMCTRL_INTFLAG_READY_Pos)              /**< (NVMCTRL_INTFLAG) NVM Ready Mask */
#define NVMCTRL_INTFLAG_READY(value)          (NVMCTRL_INTFLAG_READY_Msk & ((value) << NVMCTRL_INTFLAG_READY_Pos))
#define   NVMCTRL_INTFLAG_READY_Val_0_Val     _U_(0x0)                                             /**< (NVMCTRL_INTFLAG) The NVM controller is busy programming or erasing.  */
#define   NVMCTRL_INTFLAG_READY_Val_1_Val     _U_(0x1)                                             /**< (NVMCTRL_INTFLAG) The NVM controller is ready to accept a new command  */
#define NVMCTRL_INTFLAG_READY_Val_0           (NVMCTRL_INTFLAG_READY_Val_0_Val << NVMCTRL_INTFLAG_READY_Pos) /**< (NVMCTRL_INTFLAG) The NVM controller is busy programming or erasing. Position  */
#define NVMCTRL_INTFLAG_READY_Val_1           (NVMCTRL_INTFLAG_READY_Val_1_Val << NVMCTRL_INTFLAG_READY_Pos) /**< (NVMCTRL_INTFLAG) The NVM controller is ready to accept a new command Position  */
#define NVMCTRL_INTFLAG_ERROR_Pos             _U_(1)                                               /**< (NVMCTRL_INTFLAG) Error Position */
#define NVMCTRL_INTFLAG_ERROR_Msk             (_U_(0x1) << NVMCTRL_INTFLAG_ERROR_Pos)              /**< (NVMCTRL_INTFLAG) Error Mask */
#define NVMCTRL_INTFLAG_ERROR(value)          (NVMCTRL_INTFLAG_ERROR_Msk & ((value) << NVMCTRL_INTFLAG_ERROR_Pos))
#define   NVMCTRL_INTFLAG_ERROR_Val_0_Val     _U_(0x0)                                             /**< (NVMCTRL_INTFLAG) No errors have been received since the last clear  */
#define   NVMCTRL_INTFLAG_ERROR_Val_1_Val     _U_(0x1)                                             /**< (NVMCTRL_INTFLAG) At least one error has occurred since the last clear  */
#define NVMCTRL_INTFLAG_ERROR_Val_0           (NVMCTRL_INTFLAG_ERROR_Val_0_Val << NVMCTRL_INTFLAG_ERROR_Pos) /**< (NVMCTRL_INTFLAG) No errors have been received since the last clear Position  */
#define NVMCTRL_INTFLAG_ERROR_Val_1           (NVMCTRL_INTFLAG_ERROR_Val_1_Val << NVMCTRL_INTFLAG_ERROR_Pos) /**< (NVMCTRL_INTFLAG) At least one error has occurred since the last clear Position  */
#define NVMCTRL_INTFLAG_SERR_Pos              _U_(8)                                               /**< (NVMCTRL_INTFLAG) Single Bit Error Detection Flag Position */
#define NVMCTRL_INTFLAG_SERR_Msk              (_U_(0x1) << NVMCTRL_INTFLAG_SERR_Pos)               /**< (NVMCTRL_INTFLAG) Single Bit Error Detection Flag Mask */
#define NVMCTRL_INTFLAG_SERR(value)           (NVMCTRL_INTFLAG_SERR_Msk & ((value) << NVMCTRL_INTFLAG_SERR_Pos))
#define NVMCTRL_INTFLAG_DERR_Pos              _U_(9)                                               /**< (NVMCTRL_INTFLAG) Double bit Error detection flag Position */
#define NVMCTRL_INTFLAG_DERR_Msk              (_U_(0x1) << NVMCTRL_INTFLAG_DERR_Pos)               /**< (NVMCTRL_INTFLAG) Double bit Error detection flag Mask */
#define NVMCTRL_INTFLAG_DERR(value)           (NVMCTRL_INTFLAG_DERR_Msk & ((value) << NVMCTRL_INTFLAG_DERR_Pos))
#define NVMCTRL_INTFLAG_FLASHERR_Pos          _U_(11)                                              /**< (NVMCTRL_INTFLAG) FLASH Err Position */
#define NVMCTRL_INTFLAG_FLASHERR_Msk          (_U_(0x1) << NVMCTRL_INTFLAG_FLASHERR_Pos)           /**< (NVMCTRL_INTFLAG) FLASH Err Mask */
#define NVMCTRL_INTFLAG_FLASHERR(value)       (NVMCTRL_INTFLAG_FLASHERR_Msk & ((value) << NVMCTRL_INTFLAG_FLASHERR_Pos))
#define NVMCTRL_INTFLAG_FLTCAP_Pos            _U_(24)                                              /**< (NVMCTRL_INTFLAG) Fault Capture Interrupt Position */
#define NVMCTRL_INTFLAG_FLTCAP_Msk            (_U_(0x1) << NVMCTRL_INTFLAG_FLTCAP_Pos)             /**< (NVMCTRL_INTFLAG) Fault Capture Interrupt Mask */
#define NVMCTRL_INTFLAG_FLTCAP(value)         (NVMCTRL_INTFLAG_FLTCAP_Msk & ((value) << NVMCTRL_INTFLAG_FLTCAP_Pos))
#define NVMCTRL_INTFLAG_Msk                   _U_(0x01000B03)                                      /**< (NVMCTRL_INTFLAG) Register Mask  */


/* -------- NVMCTRL_STATUS : (NVMCTRL Offset: 0x18) (R/W 16) Status -------- */
#define NVMCTRL_STATUS_RESETVALUE             _U_(0x00)                                            /**<  (NVMCTRL_STATUS) Status  Reset Value */

