Microchip-MPLAB-Harmony/csp_apps_pic32cm_jh00_jh01/apps/nvmctrl/nvmctrl_data_flash/firmware/src/packs/PIC32CM5164JH00100_DFP/component/nvmctrl.h
#define NVMCTRL_STATUS_PRM_Pos                _U_(0)                                               /**< (NVMCTRL_STATUS) Power Reduction Mode Position */
#define NVMCTRL_STATUS_PRM_Msk                (_U_(0x1) << NVMCTRL_STATUS_PRM_Pos)                 /**< (NVMCTRL_STATUS) Power Reduction Mode Mask */
#define NVMCTRL_STATUS_PRM(value)             (NVMCTRL_STATUS_PRM_Msk & ((value) << NVMCTRL_STATUS_PRM_Pos))
#define NVMCTRL_STATUS_LOAD_Pos               _U_(1)                                               /**< (NVMCTRL_STATUS) NVM Page Buffer Active Loading Position */
#define NVMCTRL_STATUS_LOAD_Msk               (_U_(0x1) << NVMCTRL_STATUS_LOAD_Pos)                /**< (NVMCTRL_STATUS) NVM Page Buffer Active Loading Mask */
#define NVMCTRL_STATUS_LOAD(value)            (NVMCTRL_STATUS_LOAD_Msk & ((value) << NVMCTRL_STATUS_LOAD_Pos))
#define NVMCTRL_STATUS_PROGE_Pos              _U_(2)                                               /**< (NVMCTRL_STATUS) Programming Error Status Position */
#define NVMCTRL_STATUS_PROGE_Msk              (_U_(0x1) << NVMCTRL_STATUS_PROGE_Pos)               /**< (NVMCTRL_STATUS) Programming Error Status Mask */
#define NVMCTRL_STATUS_PROGE(value)           (NVMCTRL_STATUS_PROGE_Msk & ((value) << NVMCTRL_STATUS_PROGE_Pos))
#define NVMCTRL_STATUS_LOCKE_Pos              _U_(3)                                               /**< (NVMCTRL_STATUS) Lock Error Status Position */
#define NVMCTRL_STATUS_LOCKE_Msk              (_U_(0x1) << NVMCTRL_STATUS_LOCKE_Pos)               /**< (NVMCTRL_STATUS) Lock Error Status Mask */
#define NVMCTRL_STATUS_LOCKE(value)           (NVMCTRL_STATUS_LOCKE_Msk & ((value) << NVMCTRL_STATUS_LOCKE_Pos))
#define NVMCTRL_STATUS_NVME_Pos               _U_(4)                                               /**< (NVMCTRL_STATUS) NVM Error Position */
#define NVMCTRL_STATUS_NVME_Msk               (_U_(0x1) << NVMCTRL_STATUS_NVME_Pos)                /**< (NVMCTRL_STATUS) NVM Error Mask */
#define NVMCTRL_STATUS_NVME(value)            (NVMCTRL_STATUS_NVME_Msk & ((value) << NVMCTRL_STATUS_NVME_Pos))
#define NVMCTRL_STATUS_SB_Pos                 _U_(8)                                               /**< (NVMCTRL_STATUS) Security Bit Status Position */
#define NVMCTRL_STATUS_SB_Msk                 (_U_(0x1) << NVMCTRL_STATUS_SB_Pos)                  /**< (NVMCTRL_STATUS) Security Bit Status Mask */
#define NVMCTRL_STATUS_SB(value)              (NVMCTRL_STATUS_SB_Msk & ((value) << NVMCTRL_STATUS_SB_Pos))
#define NVMCTRL_STATUS_Msk                    _U_(0x011F)                                          /**< (NVMCTRL_STATUS) Register Mask  */


/* -------- NVMCTRL_ADDR : (NVMCTRL Offset: 0x1C) (R/W 32) Address -------- */
#define NVMCTRL_ADDR_RESETVALUE               _U_(0x00)                                            /**<  (NVMCTRL_ADDR) Address  Reset Value */

#define NVMCTRL_ADDR_ADDR_Pos                 _U_(0)                                               /**< (NVMCTRL_ADDR) NVM Address Position */
#define NVMCTRL_ADDR_ADDR_Msk                 (_U_(0x3FFFFF) << NVMCTRL_ADDR_ADDR_Pos)             /**< (NVMCTRL_ADDR) NVM Address Mask */
#define NVMCTRL_ADDR_ADDR(value)              (NVMCTRL_ADDR_ADDR_Msk & ((value) << NVMCTRL_ADDR_ADDR_Pos))
#define NVMCTRL_ADDR_Msk                      _U_(0x003FFFFF)                                      /**< (NVMCTRL_ADDR) Register Mask  */


/* -------- NVMCTRL_LOCK : (NVMCTRL Offset: 0x20) (R/W 16) Lock Section -------- */
#define NVMCTRL_LOCK_RESETVALUE               _U_(0x00)                                            /**<  (NVMCTRL_LOCK) Lock Section  Reset Value */

#define NVMCTRL_LOCK_LOCK_Pos                 _U_(0)                                               /**< (NVMCTRL_LOCK) Region Lock Bits Position */
#define NVMCTRL_LOCK_LOCK_Msk                 (_U_(0xFFFF) << NVMCTRL_LOCK_LOCK_Pos)               /**< (NVMCTRL_LOCK) Region Lock Bits Mask */
#define NVMCTRL_LOCK_LOCK(value)              (NVMCTRL_LOCK_LOCK_Msk & ((value) << NVMCTRL_LOCK_LOCK_Pos))
#define NVMCTRL_LOCK_Msk                      _U_(0xFFFF)                                          /**< (NVMCTRL_LOCK) Register Mask  */


/* -------- NVMCTRL_PBLDATA0 : (NVMCTRL Offset: 0x28) ( R/ 32) Page Buffer Load Data 0 -------- */
#define NVMCTRL_PBLDATA0_RESETVALUE           _U_(0xFFFFFFFF)                                      /**<  (NVMCTRL_PBLDATA0) Page Buffer Load Data 0  Reset Value */

#define NVMCTRL_PBLDATA0_PBLDATA_Pos          _U_(0)                                               /**< (NVMCTRL_PBLDATA0) Page Buffer Load Data Position */
#define NVMCTRL_PBLDATA0_PBLDATA_Msk          (_U_(0xFFFFFFFF) << NVMCTRL_PBLDATA0_PBLDATA_Pos)    /**< (NVMCTRL_PBLDATA0) Page Buffer Load Data Mask */
#define NVMCTRL_PBLDATA0_PBLDATA(value)       (NVMCTRL_PBLDATA0_PBLDATA_Msk & ((value) << NVMCTRL_PBLDATA0_PBLDATA_Pos))
#define NVMCTRL_PBLDATA0_Msk                  _U_(0xFFFFFFFF)                                      /**< (NVMCTRL_PBLDATA0) Register Mask  */


/* -------- NVMCTRL_PBLDATA1 : (NVMCTRL Offset: 0x2C) ( R/ 32) Page Buffer Load Data 1 -------- */
#define NVMCTRL_PBLDATA1_RESETVALUE           _U_(0xFFFFFFFF)                                      /**<  (NVMCTRL_PBLDATA1) Page Buffer Load Data 1  Reset Value */

#define NVMCTRL_PBLDATA1_PBLDATA_Pos          _U_(0)                                               /**< (NVMCTRL_PBLDATA1) Page Buffer Load Data Position */
#define NVMCTRL_PBLDATA1_PBLDATA_Msk          (_U_(0xFFFFFFFF) << NVMCTRL_PBLDATA1_PBLDATA_Pos)    /**< (NVMCTRL_PBLDATA1) Page Buffer Load Data Mask */
#define NVMCTRL_PBLDATA1_PBLDATA(value)       (NVMCTRL_PBLDATA1_PBLDATA_Msk & ((value) << NVMCTRL_PBLDATA1_PBLDATA_Pos))
#define NVMCTRL_PBLDATA1_Msk                  _U_(0xFFFFFFFF)                                      /**< (NVMCTRL_PBLDATA1) Register Mask  */


/* -------- NVMCTRL_ECCCTRL : (NVMCTRL Offset: 0x80) (R/W 16) ECC control -------- */
#define NVMCTRL_ECCCTRL_RESETVALUE            _U_(0x00)                                            /**<  (NVMCTRL_ECCCTRL) ECC control  Reset Value */

#define NVMCTRL_ECCCTRL_ECCDIS_Pos            _U_(0)                                               /**< (NVMCTRL_ECCCTRL) FLASH ECC Disable Position */
#define NVMCTRL_ECCCTRL_ECCDIS_Msk            (_U_(0x1) << NVMCTRL_ECCCTRL_ECCDIS_Pos)             /**< (NVMCTRL_ECCCTRL) FLASH ECC Disable Mask */
#define NVMCTRL_ECCCTRL_ECCDIS(value)         (NVMCTRL_ECCCTRL_ECCDIS_Msk & ((value) << NVMCTRL_ECCCTRL_ECCDIS_Pos))
#define   NVMCTRL_ECCCTRL_ECCDIS_En_Val       _U_(0x0)                                             /**< (NVMCTRL_ECCCTRL) Flash ECC is Enabled  */
#define   NVMCTRL_ECCCTRL_ECCDIS_Dis_Val      _U_(0x1)                                             /**< (NVMCTRL_ECCCTRL) Flash ECC is Not Enabled, once written to 1 by user ECC can only be re-enabled only by a reset  */
#define NVMCTRL_ECCCTRL_ECCDIS_En             (NVMCTRL_ECCCTRL_ECCDIS_En_Val << NVMCTRL_ECCCTRL_ECCDIS_Pos) /**< (NVMCTRL_ECCCTRL) Flash ECC is Enabled Position  */
#define NVMCTRL_ECCCTRL_ECCDIS_Dis            (NVMCTRL_ECCCTRL_ECCDIS_Dis_Val << NVMCTRL_ECCCTRL_ECCDIS_Pos) /**< (NVMCTRL_ECCCTRL) Flash ECC is Not Enabled, once written to 1 by user ECC can only be re-enabled only by a reset Position  */
#define NVMCTRL_ECCCTRL_ECCDFDIS_Pos          _U_(1)                                               /**< (NVMCTRL_ECCCTRL) Data Flash ECC Disable Position */
#define NVMCTRL_ECCCTRL_ECCDFDIS_Msk          (_U_(0x1) << NVMCTRL_ECCCTRL_ECCDFDIS_Pos)           /**< (NVMCTRL_ECCCTRL) Data Flash ECC Disable Mask */
#define NVMCTRL_ECCCTRL_ECCDFDIS(value)       (NVMCTRL_ECCCTRL_ECCDFDIS_Msk & ((value) << NVMCTRL_ECCCTRL_ECCDFDIS_Pos))
#define   NVMCTRL_ECCCTRL_ECCDFDIS_En_Val     _U_(0x0)                                             /**< (NVMCTRL_ECCCTRL) Data Flash ECC is Enabled  */
#define   NVMCTRL_ECCCTRL_ECCDFDIS_Dis_Val    _U_(0x1)                                             /**< (NVMCTRL_ECCCTRL) Data Flash ECC is Not Enabled, once written to 1 by user ECC can only be re-enabled only by a reset  */
#define NVMCTRL_ECCCTRL_ECCDFDIS_En           (NVMCTRL_ECCCTRL_ECCDFDIS_En_Val << NVMCTRL_ECCCTRL_ECCDFDIS_Pos) /**< (NVMCTRL_ECCCTRL) Data Flash ECC is Enabled Position  */
#define NVMCTRL_ECCCTRL_ECCDFDIS_Dis          (NVMCTRL_ECCCTRL_ECCDFDIS_Dis_Val << NVMCTRL_ECCCTRL_ECCDFDIS_Pos) /**< (NVMCTRL_ECCCTRL) Data Flash ECC is Not Enabled, once written to 1 by user ECC can only be re-enabled only by a reset Position  */
#define NVMCTRL_ECCCTRL_SECCNT_Pos            _U_(8)                                               /**< (NVMCTRL_ECCCTRL) Flash SEC Count Position */
#define NVMCTRL_ECCCTRL_SECCNT_Msk            (_U_(0xFF) << NVMCTRL_ECCCTRL_SECCNT_Pos)            /**< (NVMCTRL_ECCCTRL) Flash SEC Count Mask */
#define NVMCTRL_ECCCTRL_SECCNT(value)         (NVMCTRL_ECCCTRL_SECCNT_Msk & ((value) << NVMCTRL_ECCCTRL_SECCNT_Pos))
#define NVMCTRL_ECCCTRL_Msk                   _U_(0xFF03)                                          /**< (NVMCTRL_ECCCTRL) Register Mask  */


/* -------- NVMCTRL_FLTCTRL : (NVMCTRL Offset: 0x84) (R/W 16) Fault injection control -------- */
#define NVMCTRL_FLTCTRL_RESETVALUE            _U_(0x00)                                            /**<  (NVMCTRL_FLTCTRL) Fault injection control  Reset Value */

#define NVMCTRL_FLTCTRL_FLTRST_Pos            _U_(0)                                               /**< (NVMCTRL_FLTCTRL) Fault reset Position */
#define NVMCTRL_FLTCTRL_FLTRST_Msk            (_U_(0x1) << NVMCTRL_FLTCTRL_FLTRST_Pos)             /**< (NVMCTRL_FLTCTRL) Fault reset Mask */
#define NVMCTRL_FLTCTRL_FLTRST(value)         (NVMCTRL_FLTCTRL_FLTRST_Msk & ((value) << NVMCTRL_FLTCTRL_FLTRST_Pos))
#define   NVMCTRL_FLTCTRL_FLTRST_Val_0_Val    _U_(0x0)                                             /**< (NVMCTRL_FLTCTRL) No Effect  */
#define   NVMCTRL_FLTCTRL_FLTRST_Val_1_Val    _U_(0x1)                                             /**< (NVMCTRL_FLTCTRL) Resets all FLT SFR bits. {FLTCTRL, FFLTPTR, FFLTADR, FFLTCAP, FFLTPAR, FFLTSYN}  */
#define NVMCTRL_FLTCTRL_FLTRST_Val_0          (NVMCTRL_FLTCTRL_FLTRST_Val_0_Val << NVMCTRL_FLTCTRL_FLTRST_Pos) /**< (NVMCTRL_FLTCTRL) No Effect Position  */
#define NVMCTRL_FLTCTRL_FLTRST_Val_1          (NVMCTRL_FLTCTRL_FLTRST_Val_1_Val << NVMCTRL_FLTCTRL_FLTRST_Pos) /**< (NVMCTRL_FLTCTRL) Resets all FLT SFR bits. {FLTCTRL, FFLTPTR, FFLTADR, FFLTCAP, FFLTPAR, FFLTSYN} Position  */
#define NVMCTRL_FLTCTRL_FLTEN_Pos             _U_(1)                                               /**< (NVMCTRL_FLTCTRL) Fault Injection Enabled Position */
#define NVMCTRL_FLTCTRL_FLTEN_Msk             (_U_(0x1) << NVMCTRL_FLTCTRL_FLTEN_Pos)              /**< (NVMCTRL_FLTCTRL) Fault Injection Enabled Mask */
#define NVMCTRL_FLTCTRL_FLTEN(value)          (NVMCTRL_FLTCTRL_FLTEN_Msk & ((value) << NVMCTRL_FLTCTRL_FLTEN_Pos))
#define   NVMCTRL_FLTCTRL_FLTEN_Dis_Val       _U_(0x0)                                             /**< (NVMCTRL_FLTCTRL) Disables the Write/Read fault injection  */
#define   NVMCTRL_FLTCTRL_FLTEN_En_Val        _U_(0x1)                                             /**< (NVMCTRL_FLTCTRL) Enables the Write/Read fault injection to occur selected by FLTMD  */
#define NVMCTRL_FLTCTRL_FLTEN_Dis             (NVMCTRL_FLTCTRL_FLTEN_Dis_Val << NVMCTRL_FLTCTRL_FLTEN_Pos) /**< (NVMCTRL_FLTCTRL) Disables the Write/Read fault injection Position  */
#define NVMCTRL_FLTCTRL_FLTEN_En              (NVMCTRL_FLTCTRL_FLTEN_En_Val << NVMCTRL_FLTCTRL_FLTEN_Pos) /**< (NVMCTRL_FLTCTRL) Enables the Write/Read fault injection to occur selected by FLTMD Position  */
#define NVMCTRL_FLTCTRL_FLTMD_Pos             _U_(12)                                              /**< (NVMCTRL_FLTCTRL) Fault Mode Control Position */
#define NVMCTRL_FLTCTRL_FLTMD_Msk             (_U_(0x7) << NVMCTRL_FLTCTRL_FLTMD_Pos)              /**< (NVMCTRL_FLTCTRL) Fault Mode Control Mask */
#define NVMCTRL_FLTCTRL_FLTMD(value)          (NVMCTRL_FLTCTRL_FLTMD_Msk & ((value) << NVMCTRL_FLTCTRL_FLTMD_Pos))
#define   NVMCTRL_FLTCTRL_FLTMD_Val_0_Val     _U_(0x0)                                             /**< (NVMCTRL_FLTCTRL) Fault Injection Disabled  */
#define   NVMCTRL_FLTCTRL_FLTMD_Val_2_Val     _U_(0x2)                                             /**< (NVMCTRL_FLTCTRL) Fault Capture Mode Enabled (Capture the address (in FFLTCAP) and Syndrome in (FFLTSYND))  */
#define   NVMCTRL_FLTCTRL_FLTMD_Val_4_Val     _U_(0x4)                                             /**< (NVMCTRL_FLTCTRL) Single Fault Injection (at bit selected by FLT1PTR) for Reads  */
#define   NVMCTRL_FLTCTRL_FLTMD_Val_5_Val     _U_(0x5)                                             /**< (NVMCTRL_FLTCTRL) Double Fault Injection (uses FLT1PTR and FLT2PTR) for Reads  */
#define   NVMCTRL_FLTCTRL_FLTMD_Val_6_Val     _U_(0x6)                                             /**< (NVMCTRL_FLTCTRL) Single Fault Injection (at bit selected by FLT1PTR) for Writes  */
#define   NVMCTRL_FLTCTRL_FLTMD_Val_7_Val     _U_(0x7)                                             /**< (NVMCTRL_FLTCTRL) Double Fault Injection (uses FLT1PTR and FLT2PTR) for Writes  */
#define NVMCTRL_FLTCTRL_FLTMD_Val_0           (NVMCTRL_FLTCTRL_FLTMD_Val_0_Val << NVMCTRL_FLTCTRL_FLTMD_Pos) /**< (NVMCTRL_FLTCTRL) Fault Injection Disabled Position  */
#define NVMCTRL_FLTCTRL_FLTMD_Val_2           (NVMCTRL_FLTCTRL_FLTMD_Val_2_Val << NVMCTRL_FLTCTRL_FLTMD_Pos) /**< (NVMCTRL_FLTCTRL) Fault Capture Mode Enabled (Capture the address (in FFLTCAP) and Syndrome in (FFLTSYND)) Position  */
#define NVMCTRL_FLTCTRL_FLTMD_Val_4           (NVMCTRL_FLTCTRL_FLTMD_Val_4_Val << NVMCTRL_FLTCTRL_FLTMD_Pos) /**< (NVMCTRL_FLTCTRL) Single Fault Injection (at bit selected by FLT1PTR) for Reads Position  */
#define NVMCTRL_FLTCTRL_FLTMD_Val_5           (NVMCTRL_FLTCTRL_FLTMD_Val_5_Val << NVMCTRL_FLTCTRL_FLTMD_Pos) /**< (NVMCTRL_FLTCTRL) Double Fault Injection (uses FLT1PTR and FLT2PTR) for Reads Position  */
#define NVMCTRL_FLTCTRL_FLTMD_Val_6           (NVMCTRL_FLTCTRL_FLTMD_Val_6_Val << NVMCTRL_FLTCTRL_FLTMD_Pos) /**< (NVMCTRL_FLTCTRL) Single Fault Injection (at bit selected by FLT1PTR) for Writes Position  */
#define NVMCTRL_FLTCTRL_FLTMD_Val_7           (NVMCTRL_FLTCTRL_FLTMD_Val_7_Val << NVMCTRL_FLTCTRL_FLTMD_Pos) /**< (NVMCTRL_FLTCTRL) Double Fault Injection (uses FLT1PTR and FLT2PTR) for Writes Position  */
#define NVMCTRL_FLTCTRL_Msk                   _U_(0x7003)                                          /**< (NVMCTRL_FLTCTRL) Register Mask  */


/* -------- NVMCTRL_FFLTPTR : (NVMCTRL Offset: 0x88) (R/W 32) Fault injection pointer -------- */
#define NVMCTRL_FFLTPTR_RESETVALUE            _U_(0x00)                                            /**<  (NVMCTRL_FFLTPTR) Fault injection pointer  Reset Value */

