Microchip-MPLAB-Harmony/csp_apps_pic32cm_jh00_jh01/apps/nvmctrl/nvmctrl_data_flash/firmware/src/packs/PIC32CM5164JH00100_DFP/component/nvmctrl.h
#define NVMCTRL_FFLTPTR_FLT1PTR_Pos           _U_(0)                                               /**< (NVMCTRL_FFLTPTR) Fault Injection Pointer 1 Position */
#define NVMCTRL_FFLTPTR_FLT1PTR_Msk           (_U_(0xFF) << NVMCTRL_FFLTPTR_FLT1PTR_Pos)           /**< (NVMCTRL_FFLTPTR) Fault Injection Pointer 1 Mask */
#define NVMCTRL_FFLTPTR_FLT1PTR(value)        (NVMCTRL_FFLTPTR_FLT1PTR_Msk & ((value) << NVMCTRL_FFLTPTR_FLT1PTR_Pos))
#define NVMCTRL_FFLTPTR_FLT2PTR_Pos           _U_(16)                                              /**< (NVMCTRL_FFLTPTR) Fault Injection pointer 2 Position */
#define NVMCTRL_FFLTPTR_FLT2PTR_Msk           (_U_(0xFF) << NVMCTRL_FFLTPTR_FLT2PTR_Pos)           /**< (NVMCTRL_FFLTPTR) Fault Injection pointer 2 Mask */
#define NVMCTRL_FFLTPTR_FLT2PTR(value)        (NVMCTRL_FFLTPTR_FLT2PTR_Msk & ((value) << NVMCTRL_FFLTPTR_FLT2PTR_Pos))
#define NVMCTRL_FFLTPTR_Msk                   _U_(0x00FF00FF)                                      /**< (NVMCTRL_FFLTPTR) Register Mask  */


/* -------- NVMCTRL_FFLTADR : (NVMCTRL Offset: 0x8C) (R/W 32) Fault injection address -------- */
#define NVMCTRL_FFLTADR_RESETVALUE            _U_(0x00)                                            /**<  (NVMCTRL_FFLTADR) Fault injection address  Reset Value */

#define NVMCTRL_FFLTADR_FLTADR_Pos            _U_(0)                                               /**< (NVMCTRL_FFLTADR) Fault Injection Address Position */
#define NVMCTRL_FFLTADR_FLTADR_Msk            (_U_(0xFFFFFF) << NVMCTRL_FFLTADR_FLTADR_Pos)        /**< (NVMCTRL_FFLTADR) Fault Injection Address Mask */
#define NVMCTRL_FFLTADR_FLTADR(value)         (NVMCTRL_FFLTADR_FLTADR_Msk & ((value) << NVMCTRL_FFLTADR_FLTADR_Pos))
#define NVMCTRL_FFLTADR_Msk                   _U_(0x00FFFFFF)                                      /**< (NVMCTRL_FFLTADR) Register Mask  */


/* -------- NVMCTRL_FFLTCAP : (NVMCTRL Offset: 0x90) ( R/ 32) Fault error capture addr -------- */
#define NVMCTRL_FFLTCAP_RESETVALUE            _U_(0x00)                                            /**<  (NVMCTRL_FFLTCAP) Fault error capture addr  Reset Value */

#define NVMCTRL_FFLTCAP_FLTADR_Pos            _U_(0)                                               /**< (NVMCTRL_FFLTCAP) Fault Capture Address Position */
#define NVMCTRL_FFLTCAP_FLTADR_Msk            (_U_(0xFFFFFF) << NVMCTRL_FFLTCAP_FLTADR_Pos)        /**< (NVMCTRL_FFLTCAP) Fault Capture Address Mask */
#define NVMCTRL_FFLTCAP_FLTADR(value)         (NVMCTRL_FFLTCAP_FLTADR_Msk & ((value) << NVMCTRL_FFLTCAP_FLTADR_Pos))
#define NVMCTRL_FFLTCAP_Msk                   _U_(0x00FFFFFF)                                      /**< (NVMCTRL_FFLTCAP) Register Mask  */


/* -------- NVMCTRL_FFLTPAR : (NVMCTRL Offset: 0x94) ( R/ 32) Fault parity -------- */
#define NVMCTRL_FFLTPAR_RESETVALUE            _U_(0x00)                                            /**<  (NVMCTRL_FFLTPAR) Fault parity  Reset Value */

#define NVMCTRL_FFLTPAR_SECIN_Pos             _U_(0)                                               /**< (NVMCTRL_FFLTPAR) Single Error Parity Bits Position */
#define NVMCTRL_FFLTPAR_SECIN_Msk             (_U_(0xFF) << NVMCTRL_FFLTPAR_SECIN_Pos)             /**< (NVMCTRL_FFLTPAR) Single Error Parity Bits Mask */
#define NVMCTRL_FFLTPAR_SECIN(value)          (NVMCTRL_FFLTPAR_SECIN_Msk & ((value) << NVMCTRL_FFLTPAR_SECIN_Pos))
#define NVMCTRL_FFLTPAR_SECOUT_Pos            _U_(16)                                              /**< (NVMCTRL_FFLTPAR) The Calculated Single Error Parity Bits Position */
#define NVMCTRL_FFLTPAR_SECOUT_Msk            (_U_(0xFF) << NVMCTRL_FFLTPAR_SECOUT_Pos)            /**< (NVMCTRL_FFLTPAR) The Calculated Single Error Parity Bits Mask */
#define NVMCTRL_FFLTPAR_SECOUT(value)         (NVMCTRL_FFLTPAR_SECOUT_Msk & ((value) << NVMCTRL_FFLTPAR_SECOUT_Pos))
#define NVMCTRL_FFLTPAR_Msk                   _U_(0x00FF00FF)                                      /**< (NVMCTRL_FFLTPAR) Register Mask  */


/* -------- NVMCTRL_FFLTSYN : (NVMCTRL Offset: 0x98) ( R/ 32) Fault ECC syndrome -------- */
#define NVMCTRL_FFLTSYN_RESETVALUE            _U_(0x00)                                            /**<  (NVMCTRL_FFLTSYN) Fault ECC syndrome  Reset Value */

#define NVMCTRL_FFLTSYN_SECSYN_Pos            _U_(0)                                               /**< (NVMCTRL_FFLTSYN) Single Error Syndrome Position */
#define NVMCTRL_FFLTSYN_SECSYN_Msk            (_U_(0xFF) << NVMCTRL_FFLTSYN_SECSYN_Pos)            /**< (NVMCTRL_FFLTSYN) Single Error Syndrome Mask */
#define NVMCTRL_FFLTSYN_SECSYN(value)         (NVMCTRL_FFLTSYN_SECSYN_Msk & ((value) << NVMCTRL_FFLTSYN_SECSYN_Pos))
#define NVMCTRL_FFLTSYN_DERRSERR_Pos          _U_(16)                                              /**< (NVMCTRL_FFLTSYN) Double Error detected, Single error corrected Position */
#define NVMCTRL_FFLTSYN_DERRSERR_Msk          (_U_(0x3) << NVMCTRL_FFLTSYN_DERRSERR_Pos)           /**< (NVMCTRL_FFLTSYN) Double Error detected, Single error corrected Mask */
#define NVMCTRL_FFLTSYN_DERRSERR(value)       (NVMCTRL_FFLTSYN_DERRSERR_Msk & ((value) << NVMCTRL_FFLTSYN_DERRSERR_Pos))
#define NVMCTRL_FFLTSYN_Msk                   _U_(0x000300FF)                                      /**< (NVMCTRL_FFLTSYN) Register Mask  */


/* -------- NVMCTRL_DBGCTRL : (NVMCTRL Offset: 0x9C) (R/W 8) Debug control -------- */
#define NVMCTRL_DBGCTRL_RESETVALUE            _U_(0x00)                                            /**<  (NVMCTRL_DBGCTRL) Debug control  Reset Value */

#define NVMCTRL_DBGCTRL_DBGECC_Pos            _U_(1)                                               /**< (NVMCTRL_DBGCTRL) ECC errors from debugger reads are Position */
#define NVMCTRL_DBGCTRL_DBGECC_Msk            (_U_(0x3) << NVMCTRL_DBGCTRL_DBGECC_Pos)             /**< (NVMCTRL_DBGCTRL) ECC errors from debugger reads are Mask */
#define NVMCTRL_DBGCTRL_DBGECC(value)         (NVMCTRL_DBGCTRL_DBGECC_Msk & ((value) << NVMCTRL_DBGCTRL_DBGECC_Pos))
#define   NVMCTRL_DBGCTRL_DBGECC_VAL_0_Val    _U_(0x0)                                             /**< (NVMCTRL_DBGCTRL) Corrected, INTFLAG is not updated and FLT logic is not updated  */
#define   NVMCTRL_DBGCTRL_DBGECC_VAL_1_Val    _U_(0x1)                                             /**< (NVMCTRL_DBGCTRL) Not corrected, INTFLAG is not updated, and FLT logic is not updated  */
#define   NVMCTRL_DBGCTRL_DBGECC_VAL_2_Val    _U_(0x2)                                             /**< (NVMCTRL_DBGCTRL) Corrected, INTFLAG is updated and FLT logic operates as setup  */
#define   NVMCTRL_DBGCTRL_DBGECC_VAL_3_Val    _U_(0x3)                                             /**< (NVMCTRL_DBGCTRL) Not corrected, INTFLAG is not updated, and FLT logic is not updated  */
#define NVMCTRL_DBGCTRL_DBGECC_VAL_0          (NVMCTRL_DBGCTRL_DBGECC_VAL_0_Val << NVMCTRL_DBGCTRL_DBGECC_Pos) /**< (NVMCTRL_DBGCTRL) Corrected, INTFLAG is not updated and FLT logic is not updated Position  */
#define NVMCTRL_DBGCTRL_DBGECC_VAL_1          (NVMCTRL_DBGCTRL_DBGECC_VAL_1_Val << NVMCTRL_DBGCTRL_DBGECC_Pos) /**< (NVMCTRL_DBGCTRL) Not corrected, INTFLAG is not updated, and FLT logic is not updated Position  */
#define NVMCTRL_DBGCTRL_DBGECC_VAL_2          (NVMCTRL_DBGCTRL_DBGECC_VAL_2_Val << NVMCTRL_DBGCTRL_DBGECC_Pos) /**< (NVMCTRL_DBGCTRL) Corrected, INTFLAG is updated and FLT logic operates as setup Position  */
#define NVMCTRL_DBGCTRL_DBGECC_VAL_3          (NVMCTRL_DBGCTRL_DBGECC_VAL_3_Val << NVMCTRL_DBGCTRL_DBGECC_Pos) /**< (NVMCTRL_DBGCTRL) Not corrected, INTFLAG is not updated, and FLT logic is not updated Position  */
#define NVMCTRL_DBGCTRL_Msk                   _U_(0x06)                                            /**< (NVMCTRL_DBGCTRL) Register Mask  */


/** \brief NVMCTRL register offsets definitions */
#define NVMCTRL_CTRLA_REG_OFST         (0x00)              /**< (NVMCTRL_CTRLA) Control A Offset */
#define NVMCTRL_CTRLB_REG_OFST         (0x04)              /**< (NVMCTRL_CTRLB) Control B Offset */
#define NVMCTRL_PARAM_REG_OFST         (0x08)              /**< (NVMCTRL_PARAM) NVM Parameter Offset */
#define NVMCTRL_INTENCLR_REG_OFST      (0x0C)              /**< (NVMCTRL_INTENCLR) Interrupt Enable Clear Offset */
#define NVMCTRL_INTENSET_REG_OFST      (0x10)              /**< (NVMCTRL_INTENSET) Interrupt Enable Set Offset */
#define NVMCTRL_INTFLAG_REG_OFST       (0x14)              /**< (NVMCTRL_INTFLAG) Interrupt Flag Status and Clear Offset */
#define NVMCTRL_STATUS_REG_OFST        (0x18)              /**< (NVMCTRL_STATUS) Status Offset */
#define NVMCTRL_ADDR_REG_OFST          (0x1C)              /**< (NVMCTRL_ADDR) Address Offset */
#define NVMCTRL_LOCK_REG_OFST          (0x20)              /**< (NVMCTRL_LOCK) Lock Section Offset */
#define NVMCTRL_PBLDATA0_REG_OFST      (0x28)              /**< (NVMCTRL_PBLDATA0) Page Buffer Load Data 0 Offset */
#define NVMCTRL_PBLDATA1_REG_OFST      (0x2C)              /**< (NVMCTRL_PBLDATA1) Page Buffer Load Data 1 Offset */
#define NVMCTRL_ECCCTRL_REG_OFST       (0x80)              /**< (NVMCTRL_ECCCTRL) ECC control Offset */
#define NVMCTRL_FLTCTRL_REG_OFST       (0x84)              /**< (NVMCTRL_FLTCTRL) Fault injection control Offset */
#define NVMCTRL_FFLTPTR_REG_OFST       (0x88)              /**< (NVMCTRL_FFLTPTR) Fault injection pointer Offset */
#define NVMCTRL_FFLTADR_REG_OFST       (0x8C)              /**< (NVMCTRL_FFLTADR) Fault injection address Offset */
#define NVMCTRL_FFLTCAP_REG_OFST       (0x90)              /**< (NVMCTRL_FFLTCAP) Fault error capture addr Offset */
#define NVMCTRL_FFLTPAR_REG_OFST       (0x94)              /**< (NVMCTRL_FFLTPAR) Fault parity Offset */
#define NVMCTRL_FFLTSYN_REG_OFST       (0x98)              /**< (NVMCTRL_FFLTSYN) Fault ECC syndrome Offset */
#define NVMCTRL_DBGCTRL_REG_OFST       (0x9C)              /**< (NVMCTRL_DBGCTRL) Debug control Offset */

